Core/src/Documents/РасспределениеЗатратНаТовары/РасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасспределениеЗатратНаТовары</name>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасспределениеЗатратНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратТек</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаТек</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглТек</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаНов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюВТекущемМесяцеНов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиТек</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиПоСчетам</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто1</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто2</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто3</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКотроль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиТоваровНаСкладе</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себистоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийРасспределениеЗатратНаТовары/ВидыОперацийРасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасспределениеЗатратНаТовары</name>
  <enumValues>
    <name>НаТовары</name>
  </enumValues>
  <enumValues>
    <name>НаИмущество</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/РасспределениеЗатратНаТовары/ObjectModule.bsl
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг

#Область ПрограммныйИнтерфейс

// Процедура выполняет распределение затрат по количеству.
//
Процедура РаспределитьСуммуСчетовНаТоварыПоКоличеству() Экспорт
	
	ИсхСумма = 0;
	
	тзВыбранныеСтроки = ОстаткиТоваровНаСкладе.Выгрузить(Новый Структура("Отметка", Истина));
	
	БазаРаспределенияКоличество = тзВыбранныеСтроки.Итог("Количество");
	ВсегоРасходы = ОстаткиПоСчетам.Итог("Сумма");// - Расходы.Итог("СуммаНДС");
	НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(тзВыбранныеСтроки.ВыгрузитьКолонку("Количество"), 1000);
	
	Если НОД = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТовары Из ОстаткиТоваровНаСкладе Цикл
		
		Если СтрокаТовары.Отметка Тогда
			
			Коэффициент = СтрокаТовары.Количество / НОД * 1000;
			СтрокаТовары.СуммаРасходов = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаТовары.Количество / БазаРаспределенияКоличество, 2, 1),0);
			
			БазаРаспределенияКоличество = БазаРаспределенияКоличество - СтрокаТовары.Количество;
			
			ИсхСумма = ИсхСумма + СтрокаТовары.СуммаРасходов;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоКоличеству()

// Процедура выполняет распределение затрат по сумме.
//
Процедура РаспределитьСуммуСчетовНаТоварыПоСумме() Экспорт
	
	ИсхСумма = 0;
	
	тзВыбранныеСтроки = ОстаткиТоваровНаСкладе.Выгрузить(Новый Структура("Отметка", Истина));
	
	БазаРаспределенияСумма = тзВыбранныеСтроки.Итог("Себистоимость");
	ВсегоРасходы = ОстаткиПоСчетам.Итог("Сумма");// - Расходы.Итог("СуммаНДС");
	
	НОД = УправлениеНебольшойФирмойСервер.ПолучитьНОДДляМассива(тзВыбранныеСтроки.ВыгрузитьКолонку("Себистоимость"), 100);
	
	Если НОД = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТовары Из ОстаткиТоваровНаСкладе Цикл
		
		Если СтрокаТовары.Отметка Тогда
			
			Коэффициент = СтрокаТовары.Себистоимость / НОД * 100;
			СтрокаТовары.СуммаРасходов = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоРасходы - ИсхСумма) * СтрокаТовары.Себистоимость / БазаРаспределенияСумма, 2, 1), 0);
			
			БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаТовары.Себистоимость;
			ИсхСумма = ИсхСумма + СтрокаТовары.СуммаРасходов;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // РаспределитьТабЧастьРасходыПоСумме()

#КонецОбласти

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьПоОстаткамСчета() Экспорт
	
	ОстаткиПоСчетам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
    "ВЫБРАТЬ
    |	СУММА(ЗапасыОстатки.СуммаОстаток) КАК Сумма,
    |	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчета,
    |	ЗапасыОстатки.СтруктурнаяЕдиница
    |ИЗ
    |	РегистрНакопления.Запасы.Остатки(
    |			&ДатаОбработки,
    |			Организация = &Организация
    |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//|				И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
    |				И СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)) КАК ЗапасыОстатки
    |ГДЕ
    |	ЗапасыОстатки.СуммаОстаток > 0  
	|	И ЗапасыОстатки.КоличествоОстаток = 0
    |
    |СГРУППИРОВАТЬ ПО
    |	ЗапасыОстатки.СчетУчетаРегл,
    |	ЗапасыОстатки.СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("ДатаОбработки", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	КлючСвязи = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ОстаткиПоСчетам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.РасспределениеЗатратНаТовары.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	//УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары Тогда 
		
		РазницаСуммТаблиц = ОстаткиПоСчетам.Итог("Сумма") - ОстаткиТоваровНаСкладе.Итог("СуммаРасходов");
		
		Если РазницаСуммТаблиц <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='ხარჯების თანხა არ უდრის მარაგების ცხრილურ ნაწილში გადანაწილებულ თანხას!';ru='Сумма оборотов счетов не равна распределенной сумме в таблице остатков товаров!';en='Accounts speed is not equal to the sum of the distributed amounts are remnants of the goods!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли; 
	
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВнеоборотныйАктив");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиницаТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратРеглТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиницаНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратРеглНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтоимостьДляВычисленияАмортизацииТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтоимостьДляВычисленияАмортизацииНов");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество Тогда
		
		РазницаСуммТаблиц = ОстаткиПоСчетам.Итог("Сумма") - (СтоимостьДляВычисленияАмортизацииНов - СтоимостьДляВычисленияАмортизацииТек);
		
		Если РазницаСуммТаблиц <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='Сდანახარჯების თანხა არ უდრის ქონებაზე გადასანაწილებელ თანხას!';ru='Сумма оборотов счетов не равна распределенной сумме на имущество!';en='Accounts speed is not equal to the sum of the amount allocated to the property!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОстаткиПоСчетам.Итог("Сумма") = 0 Тогда 
			
		    ТекстСообщения = НСтр("ka='ხარჯის ანგარიში არარის შევსებული გადასანაწილებელი თანხა!';ru='В докумменте отсутствуют суммы распределения!';en='In dokummente no amount of distribution!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
	КонецЕсли;
		
	//+++ Дмгг
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратТек");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетПереоценкиНов");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратТекРегл");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатратНовРегл");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетПереоценкиНовРегл");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг
